In [1]:
print("Ahona!")

Ahona!

In [2]:
#import library 
import pandas as pd

In [3]:
#empty df 
df=pd.DataFrame() 
df

Empty DataFrame
Columns: []
Index: []

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

In [5]:
city=['Berlin','Dhaka','Zurich']

In [6]:
city

['Berlin', 'Dhaka', 'Zurich']

In [7]:
df=pd.DataFrame(city) 
df

        0
0  Berlin
1   Dhaka
2  Zurich

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(city)

list

In [10]:
row,col=df.shape

In [11]:
row

3

In [12]:
col

1

In [13]:
df.shape

(3, 1)

In [14]:
df

        0
0  Berlin
1   Dhaka
2  Zurich

In [15]:
df=pd.DataFrame(city,columns=['city_in_Europe']) 
df

  city_in_Europe
0         Berlin
1          Dhaka
2         Zurich

In [16]:
df=pd.DataFrame(city,columns=['city_in_Europe'],index=['c1','c2','c3']) 
df

   city_in_Europe
c1         Berlin
c2          Dhaka
c3         Zurich

In [17]:
city2=['Dortmund','paris','potsdam'] 
#dui ta list k merge korbo 
df2=pd.DataFrame(zip(city,city2),columns=['city1', 'city2'])

In [18]:
df2

    city1     city2
0  Berlin  Dortmund
1   Dhaka     paris
2  Zurich   potsdam

In [19]:
df.shape

(3, 1)

In [20]:
df2

    city1     city2
0  Berlin  Dortmund
1   Dhaka     paris
2  Zurich   potsdam

In [21]:
df2.shape

(3, 2)

In [22]:
city3=[['Bavaria','Erlangen'], ['NRW','Dordmund']]

In [23]:
city3

[['Bavaria', 'Erlangen'], ['NRW', 'Dordmund']]

In [25]:
df4=pd.DataFrame(city3,columns=['state','city']) 
df4

     state      city
0  Bavaria  Erlangen
1      NRW  Dordmund

In [26]:
city

['Berlin', 'Dhaka', 'Zurich']

In [27]:
city2

['Dortmund', 'paris', 'potsdam']

In [29]:
dict1={  
    'city1':city, 
'city2': city2 
    
} 
dict1

{'city1': ['Berlin', 'Dhaka', 'Zurich'],
 'city2': ['Dortmund', 'paris', 'potsdam']}

In [30]:
df5=pd.DataFrame(dict1) 
df5

    city1     city2
0  Berlin  Dortmund
1   Dhaka     paris
2  Zurich   potsdam

In [31]:
type(dict1)

dict

In [11]:
#import excel file  
#file_path = 'C:\\Users\\AHONA\\Videos\\ahonaPython\\Book1.xlsx'
#df = pd.read_excel(file_path)
#df

In [13]:
#print(df.value)